---
kind: type
id: T:Autodesk.Revit.DB.Architecture.HandRail
source: html/ec40bb4e-85b5-9a61-e0a4-2df23a5d5041.htm
---
# Autodesk.Revit.DB.Architecture.HandRail

Represents a hand rail element in Autodesk Revit.

## Syntax (C#)
```csharp
public class HandRail : ContinuousRail
```